released/NUC1262BSP_LLSI_RGBLED/SampleCode/Template/led_effect.c
};
#endif 
/*_____ D E F I N I T I O N S ______________________________________________*/



/*_____ M A C R O S ________________________________________________________*/



/*_____ F U N C T I O N S __________________________________________________*/


void setLED_Display(uint16_t DataCount)
{
	LLSI_PDMA_Transfer(LLSIDataBuffer,DataCount);
}

void setLED_BufferClear(void)
{

	uint32_t i = 0;

	for (i = 0 ; i < LED_DATA_LEN; i++)
	{
		LLSIDataBuffer[i] = 0x00000000;
	}

}

void setLED_ColorArrange(uint8_t DeviceNumber ,uint8_t RED, uint8_t GREEN, uint8_t BLUE)	// Output a colour Format: GGRRBB	
{
	/*
		if 6 x LEDs , last 2 MSB discard
		0xR1 B0 G0 R0, 0xG2 R2 B1 G1, 0xB3 G3 R3 B2, 0xR5 B4 G4 R4, 0x00 00 B5 G5	

		target 1 : 	arrane R , G , B data (bytes) , into uint32_t buffer

		32 bit :
		31	30	29	28	27	26	25	24
			==> R1 data
		23	22	21	20	19	18	17	16
		==>	B0 data
			15	14	13	12	11	10	9	8
			==> G0 data
		7	6	5	4	3	2	1	0
			==> R0 data (R0 ~ R7)

				LSB :  0	8	 16	   24 MSB		
		uint32_t 00 : [R0 , G0 , B0] , [R1
		uint32_t 01 : G1 , B1] , [R2 , G2
		uint32_t 02 : B2] , [R3 , G3 , B3]
		---------------------------------
		uint32_t 03 : [R4 , G4 , B4] , [R5 
		uint32_t 04 : G5 , B5] , [R6 , G6 
		uint32_t 05 : B6] , [R7 , G7 , B7] 

	
		target 2 : 	arrane G , R , B data (bytes) , into uint32_t buffer

				LSB :  0	8	 16	   24 MSB
		uint32_t 00 : [G0 , R0 , B0] , [G1
		uint32_t 01 : R1 , B1] , [G2 , R2
		uint32_t 02 : B2] , [G3 , R3 , B3]
		---------------------------------
		uint32_t 03 : [G4 , R4 , B4] , [G5 
		uint32_t 04 : R5 , B5] , [G6 , R6 
		uint32_t 05 : B6] , [G7 , R7 , B7] 


		EX : 
		6 LEDs = 6 x 3 (RGB color) = 18 bytes , need to use 5 x uin32_t buffer ( 18 / 4 = 4.5)		
		8 LEDs = 8 x 3 (RGB color) = 24 bytes , need to use 6 x uin32_t buffer ( 24 / 4 = 6)
		24 LEDs = 24 x 3 (RGB color) = 72 bytes , need to use 18 x uin32_t buffer ( 72 / 4 = 18)		
	*/

	uint32_t i = 0;
	uint8_t mod = 0;
	uint8_t div = 0;	

	mod = DeviceNumber%4;	// 
	div = DeviceNumber/4;	//	no. # array index

//	printf("DeviceNumber : 0x%2X , mod = 0x%2X , div = 0x%2X (demo : 0x%2X)\r\n" , DeviceNumber , mod ,div, DemoState);
	
	#if 1
	switch(mod)	// arrange : R , G , B
	{
		case 0:	// led index : 0
//			LLSIDataBuffer[div*3+0]= 0x00000000;
//			LLSIDataBuffer[div*3+1] = 0x00000000;
//			LLSIDataBuffer[div*3+2] = 0x00000000;

			LLSIDataBuffer[div*3+0] |= (RED) | (GREEN<<8) | (BLUE<<16);			

			break;
		case 1:	// led index : 1
//			LLSIDataBuffer[div*3+0]= 0x00000000;
//			LLSIDataBuffer[div*3+1]= 0x00000000;
//			LLSIDataBuffer[div*3+2] = 0x00000000;	

			LLSIDataBuffer[div*3+0] |= RED<<24;
			LLSIDataBuffer[div*3+1] |= (GREEN) | (BLUE<<8) ;	
			
			break;
		case 2:	// led index : 2
//			LLSIDataBuffer[div*3+0] = 0x00000000;		
//			LLSIDataBuffer[div*3+1]= 0x00000000;
//			LLSIDataBuffer[div*3+2]= 0x00000000;
		
			LLSIDataBuffer[div*3+1] |= (RED<<16) | (GREEN<<24) ;
			LLSIDataBuffer[div*3+2] |= BLUE;			
			
			break;
		case 3:	// led index : 3	
//			LLSIDataBuffer[div*3+0] = 0x00000000;
//			LLSIDataBuffer[div*3+1] = 0x00000000;
//			LLSIDataBuffer[div*3+2]= 0x00000000;

			LLSIDataBuffer[div*3+2] |= (RED<<8) | (GREEN<<16) | (BLUE<<24) ;	
		
			break;			
	}
	#else
	switch(mod)	// arrange : G , R , B
	{
		case 0:
			LLSIDataBuffer[div*3+0] |= (GREEN) | (RED<<8) | (BLUE<<16);
			break;
		case 1:
			LLSIDataBuffer[div*3+0] |= GREEN<<24;
			LLSIDataBuffer[div*3+1] |= (RED) | (BLUE<<8) ;		
			break;
		case 2:
			LLSIDataBuffer[div*3+1] |= (GREEN<<16) | (RED<<24) ;
			LLSIDataBuffer[div*3+2] |= BLUE;				
			break;
		case 3:
			LLSIDataBuffer[div*3+2] |= (GREEN<<8) | (RED<<16) | (BLUE<<24) ;	
			break;			
	}
	#endif

//	dump_buffer((uint32_t*) &LLSIDataBuffer , LED_DATA_LEN);		

}

void setLED_ColorWipe(uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint8_t index = 0 ;

	for (index = 0; index < LED_NUM; index++)
	{
		setLED_ColorArrange(index, RED, GREEN, BLUE);
	}

	setLED_Display(LED_DATA_LEN);
}


void setLED_ColorIdxChange(void)
{
	static uint8_t flag = 1;

	if (flag)		//reverse color index
	{
		if ( Coloridx >= (COLORTALBE_NUM-1))
		{
			flag = 0;
			Coloridx = COLORTALBE_NUM-1;
		}
		else
		{
			Coloridx++;
		}
	}
	else
	{
		if (Coloridx == 0)
		{
			flag = 1;
			Coloridx = 0;	
		}
		else
		{
			Coloridx--;
		}
	}
	
}

//https://github.com/fduignan/NucleoF042_SingleWS2812B/blob/master/main.c
void _stripEffect_Rainbow(uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE)	
{   
	// Cycle through the colours of the rainbow (non-uniform brightness however)
	// Inspired by : http://academe.co.uk/2012/04/arduino-cycling-through-colours-of-the-rainbow/
	
	static uint8_t Red = 255;
	static uint8_t Green = 0;
	static uint8_t Blue = 0;
	static uint8_t State = 0;
	switch (State)
	{
		case 0:{
			Green++;
			if (Green == 255)
				State = 1;
			break;
		}
		case 1:{
			Red--;
			if (Red == 0)
				State = 2;
			break;
		}
		case 2:{
			Blue++;
			if (Blue == 255)
				State = 3;			
			break;
		}
		case 3:{
			Green--;
			if (Green == 0)
				State = 4;
			break;
		}
		case 4:{
			Red++;
			if (Red == 255)
				State = 5;
			break;
		}
		case 5:{
			Blue --;
			if (Blue == 0)
				State = 0;
			break;
		}		
	}

	*GREEN = Green;
	*RED = Red;
	*BLUE = Blue;	
//	return (Green << 16) + (Red << 8) + Blue;


}

uint8_t _stripEffect_Wheel(uint8_t WheelPos , uint8_t* RED, uint8_t* GREEN, uint8_t* BLUE) 
{
	WheelPos = 255 - WheelPos;
	if(WheelPos < 85) 
	{
		*GREEN = 0;
		*RED = 255 - WheelPos * 3;
		*BLUE = WheelPos * 3;
		return 0;
		
//		return PACK_RGB(255 - WheelPos * 3, 0, WheelPos * 3);
	}
	if(WheelPos < 170) 
	{
		WheelPos -= 85;

		*GREEN = WheelPos * 3;
		*RED = 0;
		*BLUE = 255 - WheelPos * 3;
		return 0;
		
//		return PACK_RGB(0, WheelPos * 3, 255 - WheelPos * 3);
	}
	
	WheelPos -= 170;

