released/NUC1262BSP_LLSI_RGBLED/SampleCode/Template/led_effect.c
    for (i = 0; i < LED_NUM; i++) 
	{
        setLED_ColorArrange(i, intensity*((i%3)%2),intensity*(((i+1)%3)%2),intensity*(((i+2)%3)%2));

	    setLED_Display(LED_DATA_LEN);
		
	    delay_ms(time);	
			
    }

	setLED_BufferClear();
}

void getTheaterChaseRainbow(uint16_t time) 
{
	uint16_t j = 0;
	uint8_t q = 0; 
	uint16_t i=0;
	uint8_t red , green, blue = 0;
	
	for (j=0; j < 256; j++) 
	{     // cycle all 256 colors in the wheel	
		for (q=0; q < 3; q++) 
		{		
			for (i=0; i < LED_NUM ; i=i+3) 
			{
				_stripEffect_Wheel(( (i+j) % 255),&red,&green,&blue);
				setLED_ColorArrange(i+q, red,green,blue);
			
//				setLED_ColorArrange(i+q, 
//					UNPACK_R(_stripEffect_Wheel( (i+j) % 255)),
//					UNPACK_G(_stripEffect_Wheel( (i+j) % 255)),
//					UNPACK_B(_stripEffect_Wheel( (i+j) % 255)));    //turn every third pixel on
			}
			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			for (i=0; i < LED_NUM ; i=i+3) 
			{
				setLED_ColorArrange(i+q, 0 , 0 , 0);        //turn every third pixel off
			}

			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			setLED_BufferClear();	
			
		}
	}
}

void getTheaterChase(uint16_t time ,uint8_t RED, uint8_t GREEN, uint8_t BLUE) 
{
	uint16_t j = 0;
	uint16_t q = 0;
	uint16_t i = 0;

	for (j=0; j<10; j++) 
	{  //do 10 cycles of chasing

		setLED_BufferClear();
	
		for (q=0; q < 3; q++) 
		{
			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_ColorArrange(i+q, RED,GREEN,BLUE);    //turn every third pixel on
			}
			setLED_Display(LED_DATA_LEN);

			delay_ms(time);

			for (i=0; i < LED_NUM; i=i+3) 
			{
				setLED_ColorArrange(i+q, 0 , 0 , 0);        //turn every third pixel off
			}

			setLED_Display(LED_DATA_LEN);

			delay_ms(time);
//			printf("0x%2X ,0x%2X ,0x%2X ,\r\n" , RED,GREEN,BLUE);

			setLED_BufferClear();

		}

	}
}


void getRainbowCycle(uint8_t cycle , uint16_t time) 
{
	uint16_t i = 0, j = 0;
	uint8_t red , green, blue = 0;
	
	for(j=0; j<256*cycle; j++) 
	{ 
		// 5 cycles of all colors on wheel
		for(i=0; i< LED_NUM; i++) 
		{
			_stripEffect_Wheel((((i * 256 / LED_NUM) + j) & 255),&red,&green,&blue);
			setLED_ColorArrange(i,red,green,blue);
		
//			setLED_ColorArrange(i, 
//				UNPACK_R(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_G(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)),
//				UNPACK_B(_stripEffect_Wheel(((i * 256 / LED_NUM) + j) & 255)));
		}
		
		setLED_Display(LED_DATA_LEN);

		delay_ms(time);

		setLED_BufferClear();
	}
}

void getRainbow(uint16_t time)
{
	uint8_t i = 0;
	uint8_t red , green, blue = 0;
	
	for (i=0;i<LED_NUM;i++)
	{
		_stripEffect_Rainbow(&red,&green,&blue);
		setLED_ColorArrange(i,red,green,blue); // Output a colour Format: GGRRBB							
	}
	
	// Now send out the bits to the SPI bus
	setLED_Display(LED_DATA_LEN);  	

	delay_ms(time);	

	setLED_BufferClear();	
}

void getBreathing(uint16_t time)
{
//	uint8_t i = 0;
	uint16_t j = 0;
	static uint8_t flag = 1;
	static uint16_t index = 0 ;
	uint8_t red,green,blue = 0;

	red = colorsFull[index][0];
	green = colorsFull[index][1];
	blue = colorsFull[index][2];

	if (flag)
	{
		if ((index++) == (COLORTALBE_NUM-1) )
		{
			index = COLORTALBE_NUM-1;
			flag = 0;	
		}	
	}
	else
	{
		if ((index--) == 0)
		{
			index = 0;
			flag = 1;	
		}
	}

	setLED_BufferClear();
	setLED_ColorWipe(red,green,blue);
	delay_ms(time);		
}

void getSimpleTest2(void)
{

}

void getSimpleTest(void)
{
	static uint8_t cnt = 0;

	#if 1
	static uint8_t state = 1;
	
	setLED_BufferClear();

	switch(state)
	{
		case 1:
			setLED_ColorArrange(cnt , 0xFF , 0x00 , 0x00);
			if (cnt == (LED_NUM-1))
			{
				state = 2;
			}

			break;
		case 2:
			setLED_ColorArrange(cnt , 0x00 , 0xFF , 0x00);			
			if (cnt == (LED_NUM-1))
			{
				state = 3;
			}		
			break;
		case 3:
			setLED_ColorArrange(cnt , 0x00 , 0x00 , 0xFF);				
			if (cnt == (LED_NUM-1))
			{
				state = 1;
			}		
			break;			
			
	}


	setLED_Display(LED_DATA_LEN);
		
	#else	// use hard code array data , need to set LED_NUM : 6 , LED_DATA_LEN : 5  
	LLSI_PDMA_Transfer( (uint32_t*) &LLSIRGBBuffer[cnt] ,LED_DATA_LEN);
	#endif
	
	if (cnt++ == (LED_NUM-1))
	{
		cnt = 0;
	}

    printf("%s : %2d\r\n\r\n",__FUNCTION__ , cnt);
}

void StateMachine(void)
{
//	if (DemoState++ >= state_Max)
//	{
//		DemoState = state_Default+1;
//	}
//	DemoState = 0;	//quick test


	switch(DemoState)
	{
		case state_Rainbow:
			getRainbow(30);
			delay_ms(5);	
			break;

		case state_RainbowCycle:
			getRainbowCycle(10 ,10);	//(5 , 1000);
			delay_ms(120);
			break;

		case state_TheaterChase:
			getTheaterChase(60,colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);
//			getTheaterChase(60,0x00,0xFF,0x00);
//			getTheaterChase(60,0x00,0x00,0xFF);
			delay_ms(10);

			setLED_ColorIdxChange();
			break;

		case state_TheaterChaseRainbow:			
			getTheaterChaseRainbow(30);
			delay_ms(10);
			break;

		case state_RGBSequence:
			getRGBSequence(30);

			break;
		
		case state_AlternateColors:
			getAlternateColors(32*1, 32, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2], colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			setLED_ColorIdxChange();
			break;

		case state_FullEmpty:
			getFullEmpty(30, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			setLED_ColorIdxChange();
			break;
		
		case state_PatternMove:
			getPatternMove(60, 10, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			setLED_ColorIdxChange();
			break;

		#if defined (ENABLE_EXTRA_DEMO)
		case state_ColorWheel:
			getColorWheel(30);
			
			delay_ms(10);
			break;

		case state_AllColors:
			getAllColors(10);	
			break;
		#endif	/*ENABLE_EXTRA_DEMO*/

		case state_HeartBeat:
			getHeartBeat(900, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);

			setLED_ColorIdxChange();
			break;	

		case state_CircularRing:
			getCircularRing(30, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);
	
			setLED_ColorIdxChange();
			break;	
		
		case state_FromAToB:
			getFromAToB(10*16, 16, colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2], colorsFull[Coloridx][0], colorsFull[Coloridx][1], colorsFull[Coloridx][2]);
		
			setLED_ColorIdxChange();
			break;	
						
	}

//	setLED_BufferClear();

}

void led_effect(void)
{
	#if defined (ENABLE_DEBUG_WS2812_PROTOCOL)
	getSimpleTest();
	delay_ms(30);
	#else

	StateMachine();

//	getBreathing(30);

	#endif

}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
